zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704lx-pinctrl.h
/*
 * Autogenerated file
 * Copyright (c) 2026 BFLB Pinctrl Generator <nandojve@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef DT_BINDINGS_PINCTRL_BFLB_BL704LX_PINCTRL_H_
#define DT_BINDINGS_PINCTRL_BFLB_BL704LX_PINCTRL_H_

#include <dt-bindings/pinctrl/bl70xl-pinctrl.h>
#include <dt-bindings/pinctrl/bflb-common-pinctrl.h>

/* gpio0_clock_out0_dll_2_032M */
#define GPIO0_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(0, clock_out0, dll_2_032m, periph)

/* gpio0_clock_out0_dll_6_095M */
#define GPIO0_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(0, clock_out0, dll_6_095m, periph)

/* gpio0_clock_out0_xclk */
#define GPIO0_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(0, clock_out0, xclk, periph)

/* gpio0_spi_mosi */
#define GPIO0_SPI_MOSI \
	BFLB_PINMUX(0, spi, mosi, periph)

/* gpio0_pdm_clk */
#define GPIO0_PDM_CLK \
	BFLB_PINMUX(0, pdm, clk, periph)

/* gpio0_i2c_scl */
#define GPIO0_I2C_SCL \
	BFLB_PINMUX(0, i2c, scl, periph)

/* gpio0_uart0_rts */
#define GPIO0_UART0_RTS \
	BFLB_PINMUX(0, uart0, rts, periph)

/* gpio0_uart0_cts */
#define GPIO0_UART0_CTS \
	BFLB_PINMUX(0, uart0, cts, periph)

/* gpio0_uart0_tx */
#define GPIO0_UART0_TX \
	BFLB_PINMUX(0, uart0, tx, periph)

/* gpio0_uart0_rx */
#define GPIO0_UART0_RX \
	BFLB_PINMUX(0, uart0, rx, periph)

/* gpio0_pwm0_ch0 */
#define GPIO0_PWM0_CH0 \
	BFLB_PINMUX(0, pwm0, ch0, periph)

/* gpio0_jtag_tms */
#define GPIO0_JTAG_TMS \
	BFLB_PINMUX(0, jtag, tms, periph)

/* gpio1_clock_out1_f32k */
#define GPIO1_CLOCK_OUT1_F32K \
	BFLB_PINMUX(1, clock_out1, f32k, periph)

/* gpio1_clock_out1_xtal */
#define GPIO1_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(1, clock_out1, xtal, periph)

/* gpio1_clock_out1_xtal32k */
#define GPIO1_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(1, clock_out1, xtal32k, periph)

/* gpio1_spi_miso */
#define GPIO1_SPI_MISO \
	BFLB_PINMUX(1, spi, miso, periph)

/* gpio1_pdm_in0 */
#define GPIO1_PDM_IN0 \
	BFLB_PINMUX(1, pdm, in0, periph)

/* gpio1_i2c_sda */
#define GPIO1_I2C_SDA \
	BFLB_PINMUX(1, i2c, sda, periph)

/* gpio1_uart0_rts */
#define GPIO1_UART0_RTS \
	BFLB_PINMUX(1, uart0, rts, periph)

/* gpio1_uart0_cts */
#define GPIO1_UART0_CTS \
	BFLB_PINMUX(1, uart0, cts, periph)

/* gpio1_uart0_tx */
#define GPIO1_UART0_TX \
	BFLB_PINMUX(1, uart0, tx, periph)

/* gpio1_uart0_rx */
#define GPIO1_UART0_RX \
	BFLB_PINMUX(1, uart0, rx, periph)

/* gpio1_pwm1_ch0 */
#define GPIO1_PWM1_CH0 \
	BFLB_PINMUX(1, pwm1, ch0, periph)

/* gpio1_jtag_tdi */
#define GPIO1_JTAG_TDI \
	BFLB_PINMUX(1, jtag, tdi, periph)

/* gpio2_clock_out0_dll_2_032M */
#define GPIO2_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(2, clock_out0, dll_2_032m, periph)

/* gpio2_clock_out0_dll_6_095M */
#define GPIO2_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(2, clock_out0, dll_6_095m, periph)

/* gpio2_clock_out0_xclk */
#define GPIO2_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(2, clock_out0, xclk, periph)

/* gpio2_spi_ss */
#define GPIO2_SPI_SS \
	BFLB_PINMUX(2, spi, ss, periph)

/* gpio2_pdm_clk */
#define GPIO2_PDM_CLK \
	BFLB_PINMUX(2, pdm, clk, periph)

/* gpio2_i2c_scl */
#define GPIO2_I2C_SCL \
	BFLB_PINMUX(2, i2c, scl, periph)

/* gpio2_uart0_rts */
#define GPIO2_UART0_RTS \
	BFLB_PINMUX(2, uart0, rts, periph)

/* gpio2_uart0_cts */
#define GPIO2_UART0_CTS \
	BFLB_PINMUX(2, uart0, cts, periph)

/* gpio2_uart0_tx */
#define GPIO2_UART0_TX \
	BFLB_PINMUX(2, uart0, tx, periph)

/* gpio2_uart0_rx */
#define GPIO2_UART0_RX \
	BFLB_PINMUX(2, uart0, rx, periph)

/* gpio2_pwm1_ch1 */
#define GPIO2_PWM1_CH1 \
	BFLB_PINMUX(2, pwm1, ch1, periph)

/* gpio2_jtag_tck */
#define GPIO2_JTAG_TCK \
	BFLB_PINMUX(2, jtag, tck, periph)

/* gpio3_clock_out1_f32k */
#define GPIO3_CLOCK_OUT1_F32K \
	BFLB_PINMUX(3, clock_out1, f32k, periph)

/* gpio3_clock_out1_xtal */
#define GPIO3_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(3, clock_out1, xtal, periph)

/* gpio3_clock_out1_xtal32k */
#define GPIO3_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(3, clock_out1, xtal32k, periph)

/* gpio3_spi_sclk */
#define GPIO3_SPI_SCLK \
	BFLB_PINMUX(3, spi, sclk, periph)

/* gpio3_pdm_in0 */
#define GPIO3_PDM_IN0 \
	BFLB_PINMUX(3, pdm, in0, periph)

/* gpio3_i2c_sda */
#define GPIO3_I2C_SDA \
	BFLB_PINMUX(3, i2c, sda, periph)

/* gpio3_uart0_rts */
#define GPIO3_UART0_RTS \
	BFLB_PINMUX(3, uart0, rts, periph)

/* gpio3_uart0_cts */
#define GPIO3_UART0_CTS \
	BFLB_PINMUX(3, uart0, cts, periph)

/* gpio3_uart0_tx */
#define GPIO3_UART0_TX \
	BFLB_PINMUX(3, uart0, tx, periph)

/* gpio3_uart0_rx */
#define GPIO3_UART0_RX \
	BFLB_PINMUX(3, uart0, rx, periph)

/* gpio3_pwm1_ch2 */
#define GPIO3_PWM1_CH2 \
	BFLB_PINMUX(3, pwm1, ch2, periph)

/* gpio3_jtag_tdo */
#define GPIO3_JTAG_TDO \
	BFLB_PINMUX(3, jtag, tdo, periph)

/* gpio7_clock_out1_f32k */
#define GPIO7_CLOCK_OUT1_F32K \
	BFLB_PINMUX(7, clock_out1, f32k, periph)

/* gpio7_clock_out1_xtal */
#define GPIO7_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(7, clock_out1, xtal, periph)

/* gpio7_clock_out1_xtal32k */
#define GPIO7_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(7, clock_out1, xtal32k, periph)

/* gpio7_spi_sclk */
#define GPIO7_SPI_SCLK \
	BFLB_PINMUX(7, spi, sclk, periph)

/* gpio7_pdm_in0 */
#define GPIO7_PDM_IN0 \
	BFLB_PINMUX(7, pdm, in0, periph)

/* gpio7_i2c_sda */
#define GPIO7_I2C_SDA \
	BFLB_PINMUX(7, i2c, sda, periph)

/* gpio7_uart0_rts */
#define GPIO7_UART0_RTS \
	BFLB_PINMUX(7, uart0, rts, periph)

/* gpio7_uart0_cts */
#define GPIO7_UART0_CTS \
	BFLB_PINMUX(7, uart0, cts, periph)

/* gpio7_uart0_tx */
#define GPIO7_UART0_TX \
	BFLB_PINMUX(7, uart0, tx, periph)

/* gpio7_uart0_rx */
#define GPIO7_UART0_RX \
	BFLB_PINMUX(7, uart0, rx, periph)

/* gpio7_pwm1_ch1 */
#define GPIO7_PWM1_CH1 \
	BFLB_PINMUX(7, pwm1, ch1, periph)

/* gpio7_jtag_tdo */
#define GPIO7_JTAG_TDO \
	BFLB_PINMUX(7, jtag, tdo, periph)

/* gpio7_adc_ch7 */
#define GPIO7_ADC_CH7 \
	BFLB_PINMUX(7, adc, ch7, analog)

/* gpio8_clock_out0_dll_2_032M */
#define GPIO8_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(8, clock_out0, dll_2_032m, periph)

/* gpio8_clock_out0_dll_6_095M */
#define GPIO8_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(8, clock_out0, dll_6_095m, periph)

/* gpio8_clock_out0_xclk */
#define GPIO8_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(8, clock_out0, xclk, periph)

/* gpio8_spi_mosi */
#define GPIO8_SPI_MOSI \
	BFLB_PINMUX(8, spi, mosi, periph)

/* gpio8_pdm_clk */
#define GPIO8_PDM_CLK \
	BFLB_PINMUX(8, pdm, clk, periph)

