zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704lx-pinctrl.h
/* gpio8_i2c_scl */
#define GPIO8_I2C_SCL \
	BFLB_PINMUX(8, i2c, scl, periph)

/* gpio8_uart0_rts */
#define GPIO8_UART0_RTS \
	BFLB_PINMUX(8, uart0, rts, periph)

/* gpio8_uart0_cts */
#define GPIO8_UART0_CTS \
	BFLB_PINMUX(8, uart0, cts, periph)

/* gpio8_uart0_tx */
#define GPIO8_UART0_TX \
	BFLB_PINMUX(8, uart0, tx, periph)

/* gpio8_uart0_rx */
#define GPIO8_UART0_RX \
	BFLB_PINMUX(8, uart0, rx, periph)

/* gpio8_pwm1_ch2 */
#define GPIO8_PWM1_CH2 \
	BFLB_PINMUX(8, pwm1, ch2, periph)

/* gpio8_jtag_tms */
#define GPIO8_JTAG_TMS \
	BFLB_PINMUX(8, jtag, tms, periph)

/* gpio8_adc_ch8 */
#define GPIO8_ADC_CH8 \
	BFLB_PINMUX(8, adc, ch8, analog)

/* gpio9_clock_out1_f32k */
#define GPIO9_CLOCK_OUT1_F32K \
	BFLB_PINMUX(9, clock_out1, f32k, periph)

/* gpio9_clock_out1_xtal */
#define GPIO9_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(9, clock_out1, xtal, periph)

/* gpio9_clock_out1_xtal32k */
#define GPIO9_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(9, clock_out1, xtal32k, periph)

/* gpio9_spi_miso */
#define GPIO9_SPI_MISO \
	BFLB_PINMUX(9, spi, miso, periph)

/* gpio9_i2c_sda */
#define GPIO9_I2C_SDA \
	BFLB_PINMUX(9, i2c, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_pwm1_ch3 */
#define GPIO9_PWM1_CH3 \
	BFLB_PINMUX(9, pwm1, ch3, periph)

/* gpio9_jtag_tdi */
#define GPIO9_JTAG_TDI \
	BFLB_PINMUX(9, jtag, tdi, periph)

/* gpio9_adc_ch9 */
#define GPIO9_ADC_CH9 \
	BFLB_PINMUX(9, adc, ch9, analog)

/* gpio10_clock_out0_dll_2_032M */
#define GPIO10_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(10, clock_out0, dll_2_032m, periph)

/* gpio10_clock_out0_dll_6_095M */
#define GPIO10_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(10, clock_out0, dll_6_095m, periph)

/* gpio10_clock_out0_xclk */
#define GPIO10_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(10, clock_out0, xclk, periph)

/* gpio10_spi_ss */
#define GPIO10_SPI_SS \
	BFLB_PINMUX(10, spi, ss, periph)

/* gpio10_i2c_scl */
#define GPIO10_I2C_SCL \
	BFLB_PINMUX(10, i2c, scl, periph)

/* gpio10_uart0_rts */
#define GPIO10_UART0_RTS \
	BFLB_PINMUX(10, uart0, rts, periph)

/* gpio10_uart0_cts */
#define GPIO10_UART0_CTS \
	BFLB_PINMUX(10, uart0, cts, periph)

/* gpio10_uart0_tx */
#define GPIO10_UART0_TX \
	BFLB_PINMUX(10, uart0, tx, periph)

/* gpio10_uart0_rx */
#define GPIO10_UART0_RX \
	BFLB_PINMUX(10, uart0, rx, periph)

/* gpio10_pwm0_ch0 */
#define GPIO10_PWM0_CH0 \
	BFLB_PINMUX(10, pwm0, ch0, periph)

/* gpio10_jtag_tck */
#define GPIO10_JTAG_TCK \
	BFLB_PINMUX(10, jtag, tck, periph)

/* gpio11_clock_out1_f32k */
#define GPIO11_CLOCK_OUT1_F32K \
	BFLB_PINMUX(11, clock_out1, f32k, periph)

/* gpio11_clock_out1_xtal */
#define GPIO11_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(11, clock_out1, xtal, periph)

/* gpio11_clock_out1_xtal32k */
#define GPIO11_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(11, clock_out1, xtal32k, periph)

/* gpio11_spi_sclk */
#define GPIO11_SPI_SCLK \
	BFLB_PINMUX(11, spi, sclk, periph)

/* gpio11_i2c_sda */
#define GPIO11_I2C_SDA \
	BFLB_PINMUX(11, i2c, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_pwm1_ch0 */
#define GPIO11_PWM1_CH0 \
	BFLB_PINMUX(11, pwm1, ch0, periph)

/* gpio11_jtag_tdo */
#define GPIO11_JTAG_TDO \
	BFLB_PINMUX(11, jtag, tdo, periph)

/* gpio11_adc_ch10 */
#define GPIO11_ADC_CH10 \
	BFLB_PINMUX(11, adc, ch10, analog)

/* gpio12_clock_out0_dll_2_032M */
#define GPIO12_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(12, clock_out0, dll_2_032m, periph)

/* gpio12_clock_out0_dll_6_095M */
#define GPIO12_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(12, clock_out0, dll_6_095m, periph)

/* gpio12_clock_out0_xclk */
#define GPIO12_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(12, clock_out0, xclk, periph)

/* gpio12_spi_mosi */
#define GPIO12_SPI_MOSI \
	BFLB_PINMUX(12, spi, mosi, periph)

/* gpio12_i2c_scl */
#define GPIO12_I2C_SCL \
	BFLB_PINMUX(12, i2c, scl, periph)

/* gpio12_uart0_rts */
#define GPIO12_UART0_RTS \
	BFLB_PINMUX(12, uart0, rts, periph)

/* gpio12_uart0_cts */
#define GPIO12_UART0_CTS \
	BFLB_PINMUX(12, uart0, cts, periph)

/* gpio12_uart0_tx */
#define GPIO12_UART0_TX \
	BFLB_PINMUX(12, uart0, tx, periph)

/* gpio12_uart0_rx */
#define GPIO12_UART0_RX \
	BFLB_PINMUX(12, uart0, rx, periph)

/* gpio12_pwm1_ch1 */
#define GPIO12_PWM1_CH1 \
	BFLB_PINMUX(12, pwm1, ch1, periph)

/* gpio12_jtag_tms */
#define GPIO12_JTAG_TMS \
	BFLB_PINMUX(12, jtag, tms, periph)

/* gpio12_adc_ch11 */
#define GPIO12_ADC_CH11 \
	BFLB_PINMUX(12, adc, ch11, analog)

/* gpio13_clock_out1_f32k */
#define GPIO13_CLOCK_OUT1_F32K \
	BFLB_PINMUX(13, clock_out1, f32k, periph)

/* gpio13_clock_out1_xtal */
#define GPIO13_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(13, clock_out1, xtal, periph)

/* gpio13_clock_out1_xtal32k */
#define GPIO13_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(13, clock_out1, xtal32k, periph)

/* gpio13_spi_miso */
#define GPIO13_SPI_MISO \
	BFLB_PINMUX(13, spi, miso, periph)

/* gpio13_i2c_sda */
#define GPIO13_I2C_SDA \
	BFLB_PINMUX(13, i2c, sda, periph)

/* gpio13_uart0_rts */
#define GPIO13_UART0_RTS \
	BFLB_PINMUX(13, uart0, rts, periph)

/* gpio13_uart0_cts */
#define GPIO13_UART0_CTS \
	BFLB_PINMUX(13, uart0, cts, periph)

/* gpio13_uart0_tx */
#define GPIO13_UART0_TX \
	BFLB_PINMUX(13, uart0, tx, periph)

/* gpio13_uart0_rx */
#define GPIO13_UART0_RX \
	BFLB_PINMUX(13, uart0, rx, periph)

/* gpio13_pwm1_ch2 */
#define GPIO13_PWM1_CH2 \
	BFLB_PINMUX(13, pwm1, ch2, periph)

/* gpio13_jtag_tdi */
#define GPIO13_JTAG_TDI \
	BFLB_PINMUX(13, jtag, tdi, periph)

/* gpio14_clock_out0_dll_2_032M */
#define GPIO14_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(14, clock_out0, dll_2_032m, periph)

/* gpio14_clock_out0_dll_6_095M */
#define GPIO14_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(14, clock_out0, dll_6_095m, periph)

/* gpio14_clock_out0_xclk */
#define GPIO14_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(14, clock_out0, xclk, periph)

