zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704lx-pinctrl.h
/* gpio14_spi_ss */
#define GPIO14_SPI_SS \
	BFLB_PINMUX(14, spi, ss, periph)

/* gpio14_i2c_scl */
#define GPIO14_I2C_SCL \
	BFLB_PINMUX(14, i2c, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_pwm1_ch3 */
#define GPIO14_PWM1_CH3 \
	BFLB_PINMUX(14, pwm1, ch3, periph)

/* gpio14_jtag_tck */
#define GPIO14_JTAG_TCK \
	BFLB_PINMUX(14, jtag, tck, periph)

/* gpio14_adc_ch0 */
#define GPIO14_ADC_CH0 \
	BFLB_PINMUX(14, adc, ch0, analog)

/* gpio15_clock_out1_f32k */
#define GPIO15_CLOCK_OUT1_F32K \
	BFLB_PINMUX(15, clock_out1, f32k, periph)

/* gpio15_clock_out1_xtal */
#define GPIO15_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(15, clock_out1, xtal, periph)

/* gpio15_clock_out1_xtal32k */
#define GPIO15_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(15, clock_out1, xtal32k, periph)

/* gpio15_spi_sclk */
#define GPIO15_SPI_SCLK \
	BFLB_PINMUX(15, spi, sclk, periph)

/* gpio15_i2c_sda */
#define GPIO15_I2C_SDA \
	BFLB_PINMUX(15, i2c, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_pwm0_ch0 */
#define GPIO15_PWM0_CH0 \
	BFLB_PINMUX(15, pwm0, ch0, periph)

/* gpio15_jtag_tdo */
#define GPIO15_JTAG_TDO \
	BFLB_PINMUX(15, jtag, tdo, periph)

/* gpio15_adc_ch1 */
#define GPIO15_ADC_CH1 \
	BFLB_PINMUX(15, adc, ch1, analog)

/* gpio16_clock_out0_dll_2_032M */
#define GPIO16_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(16, clock_out0, dll_2_032m, periph)

/* gpio16_clock_out0_dll_6_095M */
#define GPIO16_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(16, clock_out0, dll_6_095m, periph)

/* gpio16_clock_out0_xclk */
#define GPIO16_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(16, clock_out0, xclk, periph)

/* gpio16_spi_mosi */
#define GPIO16_SPI_MOSI \
	BFLB_PINMUX(16, spi, mosi, periph)

/* gpio16_i2c_scl */
#define GPIO16_I2C_SCL \
	BFLB_PINMUX(16, i2c, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_pwm1_ch0 */
#define GPIO16_PWM1_CH0 \
	BFLB_PINMUX(16, pwm1, ch0, periph)

/* gpio16_jtag_tms */
#define GPIO16_JTAG_TMS \
	BFLB_PINMUX(16, jtag, tms, periph)

/* gpio17_clock_out1_f32k */
#define GPIO17_CLOCK_OUT1_F32K \
	BFLB_PINMUX(17, clock_out1, f32k, periph)

/* gpio17_clock_out1_xtal */
#define GPIO17_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(17, clock_out1, xtal, periph)

/* gpio17_clock_out1_xtal32k */
#define GPIO17_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(17, clock_out1, xtal32k, periph)

/* gpio17_spi_miso */
#define GPIO17_SPI_MISO \
	BFLB_PINMUX(17, spi, miso, periph)

/* gpio17_i2c_sda */
#define GPIO17_I2C_SDA \
	BFLB_PINMUX(17, i2c, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_pwm1_ch1 */
#define GPIO17_PWM1_CH1 \
	BFLB_PINMUX(17, pwm1, ch1, periph)

/* gpio17_jtag_tdi */
#define GPIO17_JTAG_TDI \
	BFLB_PINMUX(17, jtag, tdi, periph)

/* gpio17_adc_ch2 */
#define GPIO17_ADC_CH2 \
	BFLB_PINMUX(17, adc, ch2, analog)

/* gpio18_clock_out0_dll_2_032M */
#define GPIO18_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(18, clock_out0, dll_2_032m, periph)

/* gpio18_clock_out0_dll_6_095M */
#define GPIO18_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(18, clock_out0, dll_6_095m, periph)

/* gpio18_clock_out0_xclk */
#define GPIO18_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(18, clock_out0, xclk, periph)

/* gpio18_spi_ss */
#define GPIO18_SPI_SS \
	BFLB_PINMUX(18, spi, ss, periph)

/* gpio18_i2c_scl */
#define GPIO18_I2C_SCL \
	BFLB_PINMUX(18, i2c, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_pwm1_ch2 */
#define GPIO18_PWM1_CH2 \
	BFLB_PINMUX(18, pwm1, ch2, periph)

/* gpio18_jtag_tck */
#define GPIO18_JTAG_TCK \
	BFLB_PINMUX(18, jtag, tck, periph)

/* gpio18_adc_ch3 */
#define GPIO18_ADC_CH3 \
	BFLB_PINMUX(18, adc, ch3, analog)

/* gpio19_clock_out1_f32k */
#define GPIO19_CLOCK_OUT1_F32K \
	BFLB_PINMUX(19, clock_out1, f32k, periph)

/* gpio19_clock_out1_xtal */
#define GPIO19_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(19, clock_out1, xtal, periph)

/* gpio19_clock_out1_xtal32k */
#define GPIO19_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(19, clock_out1, xtal32k, periph)

/* gpio19_spi_sclk */
#define GPIO19_SPI_SCLK \
	BFLB_PINMUX(19, spi, sclk, periph)

/* gpio19_i2c_sda */
#define GPIO19_I2C_SDA \
	BFLB_PINMUX(19, i2c, sda, periph)

/* gpio19_uart0_rts */
#define GPIO19_UART0_RTS \
	BFLB_PINMUX(19, uart0, rts, periph)

/* gpio19_uart0_cts */
#define GPIO19_UART0_CTS \
	BFLB_PINMUX(19, uart0, cts, periph)

/* gpio19_uart0_tx */
#define GPIO19_UART0_TX \
	BFLB_PINMUX(19, uart0, tx, periph)

/* gpio19_uart0_rx */
#define GPIO19_UART0_RX \
	BFLB_PINMUX(19, uart0, rx, periph)

/* gpio19_pwm1_ch3 */
#define GPIO19_PWM1_CH3 \
	BFLB_PINMUX(19, pwm1, ch3, periph)

/* gpio19_jtag_tdo */
#define GPIO19_JTAG_TDO \
	BFLB_PINMUX(19, jtag, tdo, periph)

/* gpio19_adc_ch4 */
#define GPIO19_ADC_CH4 \
	BFLB_PINMUX(19, adc, ch4, analog)

