zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704lx-pinctrl.h
/* gpio20_clock_out0_dll_2_032M */
#define GPIO20_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(20, clock_out0, dll_2_032m, periph)

/* gpio20_clock_out0_dll_6_095M */
#define GPIO20_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(20, clock_out0, dll_6_095m, periph)

/* gpio20_clock_out0_xclk */
#define GPIO20_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(20, clock_out0, xclk, periph)

/* gpio20_spi_mosi */
#define GPIO20_SPI_MOSI \
	BFLB_PINMUX(20, spi, mosi, periph)

/* gpio20_i2c_scl */
#define GPIO20_I2C_SCL \
	BFLB_PINMUX(20, i2c, scl, periph)

/* gpio20_uart0_rts */
#define GPIO20_UART0_RTS \
	BFLB_PINMUX(20, uart0, rts, periph)

/* gpio20_uart0_cts */
#define GPIO20_UART0_CTS \
	BFLB_PINMUX(20, uart0, cts, periph)

/* gpio20_uart0_tx */
#define GPIO20_UART0_TX \
	BFLB_PINMUX(20, uart0, tx, periph)

/* gpio20_uart0_rx */
#define GPIO20_UART0_RX \
	BFLB_PINMUX(20, uart0, rx, periph)

/* gpio20_pwm0_ch0 */
#define GPIO20_PWM0_CH0 \
	BFLB_PINMUX(20, pwm0, ch0, periph)

/* gpio20_jtag_tms */
#define GPIO20_JTAG_TMS \
	BFLB_PINMUX(20, jtag, tms, periph)

/* gpio20_adc_ch5 */
#define GPIO20_ADC_CH5 \
	BFLB_PINMUX(20, adc, ch5, analog)

/* gpio21_clock_out1_f32k */
#define GPIO21_CLOCK_OUT1_F32K \
	BFLB_PINMUX(21, clock_out1, f32k, periph)

/* gpio21_clock_out1_xtal */
#define GPIO21_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(21, clock_out1, xtal, periph)

/* gpio21_clock_out1_xtal32k */
#define GPIO21_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(21, clock_out1, xtal32k, periph)

/* gpio21_spi_miso */
#define GPIO21_SPI_MISO \
	BFLB_PINMUX(21, spi, miso, periph)

/* gpio21_i2c_sda */
#define GPIO21_I2C_SDA \
	BFLB_PINMUX(21, i2c, sda, periph)

/* gpio21_uart0_rts */
#define GPIO21_UART0_RTS \
	BFLB_PINMUX(21, uart0, rts, periph)

/* gpio21_uart0_cts */
#define GPIO21_UART0_CTS \
	BFLB_PINMUX(21, uart0, cts, periph)

/* gpio21_uart0_tx */
#define GPIO21_UART0_TX \
	BFLB_PINMUX(21, uart0, tx, periph)

/* gpio21_uart0_rx */
#define GPIO21_UART0_RX \
	BFLB_PINMUX(21, uart0, rx, periph)

/* gpio21_pwm1_ch0 */
#define GPIO21_PWM1_CH0 \
	BFLB_PINMUX(21, pwm1, ch0, periph)

/* gpio21_jtag_tdi */
#define GPIO21_JTAG_TDI \
	BFLB_PINMUX(21, jtag, tdi, periph)

/* gpio21_adc_ch6 */
#define GPIO21_ADC_CH6 \
	BFLB_PINMUX(21, adc, ch6, analog)

/* gpio22_clock_out0_dll_2_032M */
#define GPIO22_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(22, clock_out0, dll_2_032m, periph)

/* gpio22_clock_out0_dll_6_095M */
#define GPIO22_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(22, clock_out0, dll_6_095m, periph)

/* gpio22_clock_out0_xclk */
#define GPIO22_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(22, clock_out0, xclk, periph)

/* gpio22_spi_ss */
#define GPIO22_SPI_SS \
	BFLB_PINMUX(22, spi, ss, periph)

/* gpio22_i2c_scl */
#define GPIO22_I2C_SCL \
	BFLB_PINMUX(22, i2c, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_pwm1_ch1 */
#define GPIO22_PWM1_CH1 \
	BFLB_PINMUX(22, pwm1, ch1, periph)

/* gpio22_jtag_tck */
#define GPIO22_JTAG_TCK \
	BFLB_PINMUX(22, jtag, tck, periph)

/* gpio23_clock_out1_f32k */
#define GPIO23_CLOCK_OUT1_F32K \
	BFLB_PINMUX(23, clock_out1, f32k, periph)

/* gpio23_clock_out1_xtal */
#define GPIO23_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(23, clock_out1, xtal, periph)

/* gpio23_clock_out1_xtal32k */
#define GPIO23_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(23, clock_out1, xtal32k, periph)

/* gpio23_flash2_d0 */
#define GPIO23_FLASH2_D0 \
	BFLB_PINMUX(23, flash2, d0, periph)

/* gpio23_spi_sclk */
#define GPIO23_SPI_SCLK \
	BFLB_PINMUX(23, spi, sclk, periph)

/* gpio23_i2c_sda */
#define GPIO23_I2C_SDA \
	BFLB_PINMUX(23, i2c, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_pwm1_ch2 */
#define GPIO23_PWM1_CH2 \
	BFLB_PINMUX(23, pwm1, ch2, periph)

/* gpio23_jtag_tdo */
#define GPIO23_JTAG_TDO \
	BFLB_PINMUX(23, jtag, tdo, periph)

/* gpio24_clock_out0_dll_2_032M */
#define GPIO24_CLOCK_OUT0_DLL_2_032M \
	BFLB_PINMUX(24, clock_out0, dll_2_032m, periph)

/* gpio24_clock_out0_dll_6_095M */
#define GPIO24_CLOCK_OUT0_DLL_6_095M \
	BFLB_PINMUX(24, clock_out0, dll_6_095m, periph)

/* gpio24_clock_out0_xclk */
#define GPIO24_CLOCK_OUT0_XCLK \
	BFLB_PINMUX(24, clock_out0, xclk, periph)

/* gpio24_flash2_d2 */
#define GPIO24_FLASH2_D2 \
	BFLB_PINMUX(24, flash2, d2, periph)

/* gpio24_spi_mosi */
#define GPIO24_SPI_MOSI \
	BFLB_PINMUX(24, spi, mosi, periph)

/* gpio24_i2c_scl */
#define GPIO24_I2C_SCL \
	BFLB_PINMUX(24, i2c, scl, periph)

/* gpio24_uart0_rts */
#define GPIO24_UART0_RTS \
	BFLB_PINMUX(24, uart0, rts, periph)

/* gpio24_uart0_cts */
#define GPIO24_UART0_CTS \
	BFLB_PINMUX(24, uart0, cts, periph)

/* gpio24_uart0_tx */
#define GPIO24_UART0_TX \
	BFLB_PINMUX(24, uart0, tx, periph)

/* gpio24_uart0_rx */
#define GPIO24_UART0_RX \
	BFLB_PINMUX(24, uart0, rx, periph)

/* gpio24_pwm1_ch3 */
#define GPIO24_PWM1_CH3 \
	BFLB_PINMUX(24, pwm1, ch3, periph)

/* gpio24_jtag_tms */
#define GPIO24_JTAG_TMS \
	BFLB_PINMUX(24, jtag, tms, periph)

/* gpio25_clock_out1_f32k */
#define GPIO25_CLOCK_OUT1_F32K \
	BFLB_PINMUX(25, clock_out1, f32k, periph)

/* gpio25_clock_out1_xtal */
#define GPIO25_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(25, clock_out1, xtal, periph)

/* gpio25_clock_out1_xtal32k */
#define GPIO25_CLOCK_OUT1_XTAL32K \
	BFLB_PINMUX(25, clock_out1, xtal32k, periph)

/* gpio25_flash2_d1 */
#define GPIO25_FLASH2_D1 \
	BFLB_PINMUX(25, flash2, d1, periph)

/* gpio25_spi_miso */
#define GPIO25_SPI_MISO \
	BFLB_PINMUX(25, spi, miso, periph)

/* gpio25_i2c_sda */
#define GPIO25_I2C_SDA \
	BFLB_PINMUX(25, i2c, sda, periph)

/* gpio25_uart0_rts */
#define GPIO25_UART0_RTS \
	BFLB_PINMUX(25, uart0, rts, periph)

